letters = [c for c in 'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ0123456789']
morse = ['.-', '-...', '.--', '--.', '-..', '.', '.', '...-',
          '--..', '..', '.---', '-.-', '.-..', '--', '-.', '---',
            '.--.', '.-.', '...', '-', '..-', '..-.', '....', '-.-.',
              '---.', '----', '--.-', '.--.-.', '-.--', '-..-', '..-..', 
              '..-..', '..--', '.-.-',
            '-----', '.----', '..---', '...--',
            '....-', '.....', '-....', '--...', '---..', '----.']
alphabet = dict(zip(letters, morse))
list1k = input('Введите ваше слово: ').upper()
print('Процесс')
for i in range(5):
    print('Зашифровка',(i+1)*'.')

for s in list1k:
    if s in alphabet:
        print(alphabet[s],end=' ')
    elif s == ' ':
        print(' ', end=' ')  # Двойной пробел между словами
    else:
        print(s, end=' ')
#print(alphabet)